In [2]:
import numpy as np
import pandas as pd

# apa perbedaan dari kedua library ini? berikut

In [3]:
# (pertama) hasil numpy tidak ada indeks sedangkan pandas ada

label = ['satu', 'dua', 'tiga']

In [4]:
angka = [10,20,30]

In [6]:
# pakai numpy

np_angka = np.array(angka)
np_angka

array([10, 20, 30])

In [7]:
# pakai pandas (disini kita pakai dictionari)

d = {'satu':10, 'dua':20, 'tiga':30}

In [8]:
pd.Series(data=angka)

0    10
1    20
2    30
dtype: int64

In [14]:
# (kedua) indeks numpy deffault berupa angka, pandas indeks nya bisa kita rubah

pd.Series(data=angka, index=['kudil', 'madun', 'dede'])

kudil    10
madun    20
dede     30
dtype: int64

In [15]:
pd.Series(d) # d adalah dictionari yang sudah dibuat

satu    10
dua     20
tiga    30
dtype: int64

In [16]:
pd.Series(np_angka) # int32 bit

0    10
1    20
2    30
dtype: int32

In [11]:
pd.Series(angka) #int64 bit akan berdampak dan mengetahui effect nya ketika menggunakan data yang besar

0    10
1    20
2    30
dtype: int64

In [17]:
# merubah pd.Series menjadi dataframe

dataku = pd.Series(data=angka, index=label)
dataku

satu    10
dua     20
tiga    30
dtype: int64

In [18]:
type(dataku)

pandas.core.series.Series

In [14]:
dataku.to_frame ()

       0
satu  10
dua   20
tiga  30

In [19]:
d2 = {'satu':10, 'dua':20, 'tiga':30, 'empat':40, 'lima':50}

In [20]:
dataku = pd.Series(d)

In [21]:
dataku2 = pd.Series(d2)

In [22]:
dataku

satu    10
dua     20
tiga    30
dtype: int64

In [23]:
dataku2

satu     10
dua      20
tiga     30
empat    40
lima     50
dtype: int64

In [24]:
dataku + dataku2 #pandas hanya menjumlahkan yang indek nya sama #tipe berubah mejadi float

dua      40.0
empat     NaN
lima      NaN
satu     20.0
tiga     60.0
dtype: float64

**Dataframe adalah dua dimensi**

In [2]:
import numpy as np
import pandas as pd

In [3]:
np.random.seed(100)

In [4]:
# urutannya adalah SHIFT + TAB (data, index, columns)

In [26]:
dataku = pd.DataFrame(np.random.randn(3,5), ['A', 'B', 'C'], ['satu', 'dua', 'tiga', 'empat', 'lima'])

In [27]:
dataku

       satu       dua      tiga     empat      lima
A  0.296832 -0.098971  0.930598 -1.613690  0.677142
B  1.184807  1.139094 -1.139095  2.398215  0.059194
C  0.787733  0.453587  1.162747 -0.341613 -1.202544

In [28]:
type(dataku['dua'])

pandas.core.series.Series

In [8]:
# pakai iloc loc (menambahkan columns)

dataku['baru'] = dataku ['empat'] + dataku ['lima']
dataku

       satu       dua      tiga     empat      lima      baru
A -1.749765  0.342680  1.153036 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -1.070043 -0.189496  0.255001  0.065506
C -0.458027  0.435163 -0.583595  0.816847  0.672721  1.489568

In [ ]:
# cara menghapus sebuah culumns

dataku.drop ('tiga', axis=1)

In [10]:
dataku2 = dataku.drop ('tiga', axis=1)
dataku2

       satu       dua     empat      lima      baru
A -1.749765  0.342680 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -0.189496  0.255001  0.065506
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [30]:
# jika tidak ingin mendefinisikan dataku2 maka langsung saja

dataku.drop ('tiga', axis=1, inplace=True)

In [31]:
dataku

       satu       dua     empat      lima
A  0.296832 -0.098971 -1.613690  0.677142
B  1.184807  1.139094  2.398215  0.059194
C  0.787733  0.453587 -0.341613 -1.202544

In [17]:
dataku['baru'] = dataku ['empat'] + dataku ['lima']
dataku

       satu       dua     empat      lima      baru
A -1.749765  0.342680 -0.252436  0.981321  0.728885
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [20]:
dataku.drop ('A', axis=0, inplace=True) #menghilangkan baris A

In [21]:
dataku

       satu       dua     empat      lima      baru
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [22]:
dataku.shape # mengetahui dimensi data

(1, 5)

In [25]:
#kita buat dari awal yang baru

dataku = pd.DataFrame(np.random.randn(3,5), ['A', 'B', 'C'], ['satu', 'dua', 'tiga', 'empat', 'lima'])
dataku

       satu       dua      tiga     empat      lima
A -0.104411 -0.531280  1.029733 -0.438136 -1.118318
B  1.618982  1.541605 -0.251879 -0.842436  0.184519
C  0.937082  0.731000  1.361556 -0.326238  0.055676

In [26]:
dataku < 0 #boolean kurang dari null

    satu    dua   tiga  empat   lima
A   True   True  False   True   True
B  False  False   True   True  False
C  False  False  False   True  False

In [30]:
dataku.drop ('tiga', axis=1, inplace=True)
dataku

       satu       dua     empat      lima
A -0.104411 -0.531280 -0.438136 -1.118318
B  1.618982  1.541605 -0.842436  0.184519
C  0.937082  0.731000 -0.326238  0.055676

In [31]:
dataku.drop ('B', axis=0, inplace=True)
dataku

       satu      dua     empat      lima
A -0.104411 -0.53128 -0.438136 -1.118318
C  0.937082  0.73100 -0.326238  0.055676

In [34]:
# slicing dengan cara

dataku [dataku<0]

       satu      dua     empat      lima
A -0.104411 -0.53128 -0.438136 -1.118318
C       NaN      NaN -0.326238       NaN

In [32]:
# kembalikan kondisi dataku ke awal

dataku = pd.DataFrame(np.random.randn(3,5), ['A', 'B', 'C'], ['satu', 'dua', 'tiga', 'empat', 'lima'])
dataku

       satu       dua      tiga     empat      lima
A  1.214521  0.482737 -1.446977 -1.087656  1.374623
B -1.867861 -1.887761 -0.003386  0.190179 -1.023815
C -1.227961  0.068651  0.947692 -1.359247 -1.536593

In [33]:
dataku[dataku['tiga']>0] #kolom 'tiga' yang  lebih besar dari null, maka hasil akan ada kolom tiga yang bernilai True

       satu       dua      tiga     empat      lima
C -1.227961  0.068651  0.947692 -1.359247 -1.536593

In [34]:
hasil = dataku[dataku['lima']>0] # yang masuk ke dalam hasil adalah True dari kolom 'lima'
hasil

       satu       dua      tiga     empat      lima
A  1.214521  0.482737 -1.446977 -1.087656  1.374623

**DATA KAPAL TITANIC**

In [38]:
dataku = pd.read_csv('kapal_titanic.csv')
dataku

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [39]:
age = dataku['age']
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [40]:
age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [41]:
age.count() #untuk mengethaui ada berapa baris yang tidak NaN (kosong)

714

In [43]:
# cara membersihkan data
# method untuk data kosong (missing data)

sum(age) # ini adalah sum fungsi bawaan pytho

nan

In [44]:
age.sum(skipna=True)

21205.17

In [46]:
age.sum() # pandas akan secara otomatis men skip data yang kosong

21205.17

In [47]:
age.sum(skipna=False)

nan

In [48]:
age.std()

14.526497332334044

In [50]:
age_bersih = age.dropna() #lenght ada 714 baris
age_bersih

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: age, Length: 714, dtype: float64

In [51]:
age # 891 baris

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [53]:
age[888]

nan

In [54]:
age_bersih[888]

KeyError: 888

In [55]:
dataku = dataku.dropna() # data nul pada baris akan hilang
dataku

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
1           1       1  female  38.0      1      0  71.2833        C    C
3           1       1  female  35.0      1      0  53.1000        S    C
6           0       1    male  54.0      0      0  51.8625        S    E
10          1       3  female   4.0      1      1  16.7000        S    G
11          1       1  female  58.0      0      0  26.5500        S    C
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
871         1       1  female  47.0      1      1  52.5542        S    D
872         0       1    male  33.0      0      0   5.0000        S    B
879         1       1  female  56.0      0      1  83.1583        C    C
887         1       1  female  19.0      0      0  30.0000        S    B
889         1       1    male  26.0      0      0  30.0000        C    C

[182 rows x 9 columns]

In [56]:
dataku = dataku.dropna(axis=1) # data nul pada kolom akan hilang
dataku

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
1           1       1  female  38.0      1      0  71.2833        C    C
3           1       1  female  35.0      1      0  53.1000        S    C
6           0       1    male  54.0      0      0  51.8625        S    E
10          1       3  female   4.0      1      1  16.7000        S    G
11          1       1  female  58.0      0      0  26.5500        S    C
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
871         1       1  female  47.0      1      1  52.5542        S    D
872         0       1    male  33.0      0      0   5.0000        S    B
879         1       1  female  56.0      0      1  83.1583        C    C
887         1       1  female  19.0      0      0  30.0000        S    B
889         1       1    male  26.0      0      0  30.0000        C    C

[182 rows x 9 columns]

In [58]:
dataku = dataku.dropna(thresh=9) #thresh digunakan untuk memastikan minimal ada sekian data dalam satu baris NaN maka baris itu 
# dipertahankan jika kurang dari itu akan dikurangkan
dataku

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
1           1       1  female  38.0      1      0  71.2833        C    C
3           1       1  female  35.0      1      0  53.1000        S    C
6           0       1    male  54.0      0      0  51.8625        S    E
10          1       3  female   4.0      1      1  16.7000        S    G
11          1       1  female  58.0      0      0  26.5500        S    C
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
871         1       1  female  47.0      1      1  52.5542        S    D
872         0       1    male  33.0      0      0   5.0000        S    B
879         1       1  female  56.0      0      1  83.1583        C    C
887         1       1  female  19.0      0      0  30.0000        S    B
889         1       1    male  26.0      0      0  30.0000        C    C

[182 rows x 9 columns]

In [60]:
# Method paling penting
# data yang berbentuk NaN (data kosong) jangan sekali-kali dihilangkan karena pasti ada informasi penting lain didalamnya
# cara amannya adalah data NaN dimasukan data rata-rata

In [62]:
dataku = pd.read_csv('kapal_titanic.csv')
dataku

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [63]:
dataku2 = dataku
dataku2

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [65]:
dataku2.age.fillna(value=dataku2.age.mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

In [67]:
dataku2.age = dataku2.age.fillna(value=dataku2.age.mean())
dataku2

     survived  pclass     sex        age  sibsp  parch     fare embarked deck
0           0       3    male  22.000000      1      0   7.2500        S  NaN
1           1       1  female  38.000000      1      0  71.2833        C    C
2           1       3  female  26.000000      0      0   7.9250        S  NaN
3           1       1  female  35.000000      1      0  53.1000        S    C
4           0       3    male  35.000000      0      0   8.0500        S  NaN
..        ...     ...     ...        ...    ...    ...      ...      ...  ...
886         0       2    male  27.000000      0      0  13.0000        S  NaN
887         1       1  female  19.000000      0      0  30.0000        S    B
888         0       3  female  29.699118      1      2  23.4500        S  NaN
889         1       1    male  26.000000      0      0  30.0000        C    C
890         0       3    male  32.000000      0      0   7.7500        Q  NaN

[891 rows x 9 columns]